Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: མཐའ་ཞེས་བྱ་བ་ནི་ནང་དང་ཕྱིའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་རྣམ་པར་ཤེས་པ་མི་གནས་པའོ། །
en: “The ‘limits’ are inner and outer, whereas ‘enfoldment’ is not based on consciousness.

source: མཐའ་ཞེས་བྱ་བ་ནི་ལས་དང་རྣམ་པར་སྨིན་པའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་ལས་མེད་པ་དང་རྣམ་པར་སྨིན་པ་མེད་པའོ། །
en: The ‘limits’ are karma and maturation, whereas ‘enfoldment’ is beyond karma and maturation.

source: མཐའ་ཞེས་བྱ་བ་ནི་དགེ་བ་དང་མི་དགེ་བའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་མངོན་པར་འདུ་བྱེད་པ་མེད་པའོ། །
en: The ‘limits’ are virtue and nonvirtue, whereas ‘enfoldment’ is beyond conditioning.

source: མཐའ་ཞེས་བྱ་བ་ནི་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་ཁ་ན་མ་ཐོ་བ་མེད་པའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་གཉིས་སུ་མེད་པའོ། །
en: The ‘limits’ are having or lacking culpability, whereas ‘enfoldment’ is without duality.

source: མཐའ་ཞེས་བྱ་བ་ནི་ལས་དང་ཉོན་མོངས་པ་རྣམས་སོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་རང་བཞིན་གྱིས་འོད་གསལ་བའོ། །
en: The ‘limits’ are karma and afflictive emotions, whereas ‘enfoldment’ is natural luminosity.

source: མཐའ་ཞེས་བྱ་བ་ནི་བདག་དང་བདག་མེད་པའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་ཤིན་ཏུ་རྣམ་པར་དག་པའོ། །
en: The ‘limits’ are self and no self, whereas ‘enfoldment’ is complete purity.

source: མཐའ་ཞེས་བྱ་བ་ནི་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པའོ། །འཁྱིལ་བ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའོ། །
en: The ‘limits’ are saṃsāra and nirvāṇa, whereas ‘enfoldment’ means that all phenomena are thoroughly transcendent by nature.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་མཐའ་ཡས་པ་བསྟན་པ་ཚད་མེད་དོ། །
en: “Therefore, son of noble family, the teaching on limitlessness is boundless.

source: འཁྱིལ་བ་བསྟན་པ་ཚད་མེད་དོ། །
en: The teaching on enfoldment is boundless.

source: འཁྱིལ་བ་མཐའ་ཡས་པའི་གཟུངས་འདི་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མཐའ་ཡས་པའི་རྗེས་སུ་སོང་། ཆོས་འཁྱིལ་བའི་རྗེས་སུ་སོང་བས་བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་མཐའ་ཡས་པར་ཆོས་སྟོན་ཀྱང་དོན་དང་ཚིག་འབྲུས་གཟུངས་ཀྱི་ཡེ་ཤེས་འདིའི་མཐར་མི་ཕྱིན་ཏོ། །
en: Since bodhisattvas established in this limitless enfoldment dhāraṇī are aligned with limitlessness and are aligned with enfoldment, even if they were to teach the Dharma for limitless hundreds of thousands of eons, they would not reach the end of the wisdom that retains meanings and syllables.

source: འདི་ནི་འཁྱིལ་བ་མཐའ་ཡས་པའི་གཟུངས་ལ་གཞོལ་བར་འཇུག་པ་དང་། རྗེས་སུ་འགྲོ་བར་བསྟན་པ་དང་། ཡེ་ཤེས་ཀྱི་སྣང་བ་རྗེས་སུ་རྟོགས་པ་དང་། རྣམ་པར་དག་པའི་སྒོ་ལ་རབ་རིབ་མེད་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འགྲོ་བ་རྗེས་སུ་རྟོགས་པའོ། །
en: This is the introduction to the limitless enfoldment dhāraṇī, the corresponding Dharma, the attendant realization of the illumination of wisdom, and the corresponding realization of unclouded wisdom with regard to this pure gateway.

source: རིགས་ཀྱི་བུ་དེ་ལ་རྒྱ་མཚོའི་ཕྱག་རྒྱའི་གཟུངས་གང་ཞེ་ན།
en: (4) “Son of noble family, you may then ask, ‘What is the ocean mudrā dhāraṇī?’

source: འདི་ལྟ་སྟེ།
en: It is as follows:

source: དཔེར་ན་གླིང་བཞི་པ་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་གང་དག་གཟུགས་སུ་སྣང་བ་དང་། སེམས་ཅན་གྱི་གཟུགས་སུ་སྣང་བའམ། རིའི་གཟུགས་སུ་སྣང་བའམ། ཤིང་གི་གཟུགས་སུ་སྣང་བའམ།
en: To give an analogy, all that appears in the world realm of the four great continents comprises appearances in the form of beings, mountains, and trees;

source: རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་དང་། ལོ་ཏོག་གི་གཟུགས་སུ་སྣང་བའམ།
en: grasses, bushes, medicinal herbs, forests, and harvests;

source: ཟླ་བ་དང་། ཉི་མ་དང་། སྐར་མ་དང་། ནོར་བུ་དང་། སྤྲིན་དང་། མེ་དང་། གློག་གི་གཟུགས་སུ་སྣང་བའམ།
en: the moon, the sun, the stars, gems, clouds, fire, and lightning;

source: གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་གྱི་དབྱིབས་ཀྱི་གཟུགས་སུ་སྣང་བའམ། གཞལ་མེད་ཁང་དང་ལོངས་སྤྱོད་ཀྱི་གཟུགས་སུ་སྣང་བའམ། སྐྱེད་མོས་ཚལ་དང་། ཆུ་མིག་དང་། མཚེའུ་དང་། ལྟེང་ཀ་དང་། འབབ་ཆུའི་གཟུགས་སུ་སྣང་བའམ། ཉེ་བར་སྤྱོད་པའམ། ཡོངས་སུ་སྤྱོད་པ་ཐམས་ཅད་ཀྱི་གཟུགས་སུ་སྣང་བ་ངན་པ་དང་། འབྲིང་དང་། རབ་དང་།
en: the layouts of cities, towns, and hamlets; palaces and riches; parks, springs, ponds, sprouts, and fountains; and all resources or objects of enjoyment, whether inferior, average, or supreme.

source: གཟུགས་སུ་སྣང་བ་དེ་དག་ཐམས་ཅད་རྒྱ་མཚོ་ཆེན་པོ་ལ་རྒྱ་དང་བཅས་པར་མི་ཉུང་། མི་མང་། ལྷག་པ་མེད་པས་དེའི་ཕྱིར་རྒྱ་མཚོ་ཆེན་པོ་ཞེས་བྱའོ། །
en: “Since all these forms of appearance are sealed by the great ocean in a manner that is not too little, not too much, and not excessive, the ocean is known to be great.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་རྒྱ་མཚོའི་ཕྱག་རྒྱའི་གཟུངས་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་ལུས་རྒྱ་དང་མཚུངས་པ་ཡིན་ནོ། །སེམས་ཅན་ཐམས་ཅད་ལ་ངག་རྒྱ་དང་མཚུངས་པ་ཡིན་ནོ། །སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་རྒྱ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: Son of noble family, for bodhisattvas who are established in the ocean mudrā dhāraṇī, it is like a seal that seals the bodies of all sentient beings, the speech of all sentient beings, and the minds of all sentient beings.

source: ཕྱོགས་བཅུ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཆོས་སྟོན་པའི་གསུང་གི་འཕྲིན་ལས་ཇི་སྙེད་འཇུག་པ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཁའི་སྒོ་ནས་ཕྱག་རྒྱས་བཏབ་པ་དང་མཚུངས་པར་འབྱུང་ངོ་། །
en: To whatever extent these bodhisattvas engage in the liberating activity of speech in promulgating the Dharma of the blessed buddhas of the ten directions, it is as if they mark things with a seal by way of such utterance.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་ཕྱག་རྒྱས་བཏབ་དེ་གང་ཅི་རྗོད་པ་དེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་ཕྱག་རྒྱས་རྣམ་པར་མི་རྟོག་པར་ཕྱག་རྒྱ་ཐམས་ཅད་སྟོན་པ་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པར་འགྱུར་རོ། །
en: Anything that bodhisattvas may express, which bears the seal of the Tathāgata, the seal of nonconceptuality, teaches everyone the seal of the Tathāgata, the seal of nonconceptuality, without recourse to any extraneous means.

source: དེ་ལ་ཕྱག་རྒྱ་བསྟན་པ་ནི་འདི་ཡིན་ཏེ། འདི་ལྟ་སྟེ།
en: “Thus, the teaching concerning their seals is as follows.

source: ཨ་ཞེས་བྱ་བ་ནི་མངོན་པར་འདུ་བྱེད་མེད་པའི་ཕྱག་རྒྱའོ། །
en: A is the seal of the unconditioned.

source: ར་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ལ་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པའི་ཕྱག་རྒྱའོ། །
en: Ra is the seal of the attainment of freedom from desire regarding any phenomenon.

source: པ་ཞེས་བྱ་བ་ནི་དོན་དམ་པ་བསྟན་པའི་ཕྱག་རྒྱའོ། །
en: Pa is the seal of teachings on the ultimate.

source: ཙ་ཞེས་བྱ་བ་ནི་མིག་རྣམ་པར་དག་པའི་ཕྱག་རྒྱའོ། །
en: Tsa is the seal of pure vision.

source: ན་ཞེས་བྱ་བ་ནི་མིང་དང་གཟུགས་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པའི་ཕྱག་རྒྱའོ། །
en: Na is the seal of the knowledge of all name and form.

source: ལ་ཞེས་བྱ་བ་ནི་སྲེད་པའི་འཁྲི་ཤིང་དང་བྲལ་བའི་ཕྱག་རྒྱའོ། །
en: La is the seal of extrication from the vines of craving.

source: ད་ཞེས་བྱ་བ་ནི་སྟོབས་བཅུ་ཡོངས་སུ་དག་པའི་ཕྱག་རྒྱའོ། །
en: Da is the seal of the pure ten strengths.

source: བ་ཞེས་བྱ་བ་ནི་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོངས་སུ་དག་པའི་ཕྱག་རྒྱའོ། །
en: Ba is the seal of the pure factors of awakening and strengths.

source: ཌ་ཞེས་བྱ་བ་ནི་ཁྲག་ཁྲུག་དང་བྲལ་བ་དང་གདུང་བས་གདུང་བ་དང་བྲལ་བའི་ཕྱག་རྒྱའོ། །
en: Ḍa is the seal of freedom from upset and agony.

source: ཥ་ཞེས་བྱ་བ་ནི་མངོན་པར་ཤེས་པ་དྲུག་འཐོབ་པའི་ཕྱག་རྒྱའོ། །
en: Ṣa is the seal of attaining the six kinds of superknowledge.

source: བ་ཞེས་བྱ་བ་ནི་གཡོན་ཕྱོགས་ཀྱི་ལམ་རྣམ་པར་སྤངས་པའི་ཕྱག་རྒྱའོ། །
en: Ba is the seal of abandoning the left-hand path.

source: ཏ་ཞེས་བྱ་བ་ནི་དེ་ཁོ་ན་བསྟན་པའི་ཕྱག་རྒྱའོ། །
en: Ta is the seal of the teaching on suchness.

source: ཡ་ཞེས་བྱ་བ་ནི་ཇི་ལྟ་བ་བཞིན་གྱི་ཕྱག་རྒྱའོ། །
en: Ya is the seal that accords with the way things are.

source: སྟ་ཞེས་བྱ་བ་ནི་ཁེངས་པའི་ཐ་བ་དང་བྲལ་བའི་ཕྱག་རྒྱའོ། །
en: Sta is the seal of freedom from the afflictive emotion of arrogance.

source: ཀ་ཞེས་བྱ་བ་ནི་ཐེ་ཚོམ་དང་བྲལ་བའི་ཕྱག་རྒྱའོ། །
en: Ka is the seal of freedom from doubt.

source: ས་ཞེས་བྱ་བ་ནི་བདེན་པ་བསྟན་པའི་ཕྱག་རྒྱའོ། །
en: Sa is the seal of teaching truth.

source: མ་ཞེས་བྱ་བ་ནི་ལམ་རྣམ་པར་དག་པའི་ཕྱག་རྒྱའོ། །
en: Ma is the seal of the pure path.

source: ག་ཞེས་བྱ་བ་ནི་ཟབ་མོ་ལ་འཇུག་པའི་ཕྱག་རྒྱའོ། །
en: Ga is the seal of entry into the profound.

source: སྠ་ཞེས་བྱ་བ་ནི་མཐུ་དང་སྟོབས་ཀུན་དུ་བསྟན་པའི་ཕྱག་རྒྱའོ། །
en: Sṭha is the seal of demonstrating power and might.

source: ཛ་ཞེས་བྱ་བ་ནི་རྒ་ཤི་ལས་ཤིན་ཏུ་འདའ་བའི་ཕྱག་རྒྱའོ། །
en: Dza is the seal of transcending old age and death.

source: ཤྭ་ཞེས་བྱ་བ་ནི་གཅན་གཟན་གྱི་ཉེས་པ་རྣམ་པར་སྤངས་པའི་ཕྱག་རྒྱའོ། །
en: Shwa is the seal of abandoning the hazards of wild animals.

source: དྷ་ཞེས་བྱ་བ་ནི་ཆོས་ཀྱི་དབྱིངས་འདྲེས་པ་མེད་པའི་ཕྱག་རྒྱའོ། །
en: Dha is the seal of the stainless realm of phenomena.

source: ཤ་ཞེས་བྱ་བ་ནི་ཞི་གནས་ཡོངས་སུ་རྫོགས་པའི་ཕྱག་རྒྱའོ། །
en: Sha is the seal of the perfection of tranquil abiding.

source: ཁ་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་མི་ཟད་པའི་ཆོས་ཉིད་ཀྱི་ཕྱག་རྒྱའོ། །
en: Kha is the seal of the basic nature of imperishable space.

source: ཀྵ་ཞེས་བྱ་བ་ནི་ཟད་པ་ཤེས་པ་དང་། མི་སྐྱེ་བ་ཤེས་པའི་ཕྱག་རྒྱའོ། །
en: Kṣha is the seal of knowledge of the perishable and of the unborn.

source: སུ་ཞེས་བྱ་བ་ནི་རྨུགས་པའི་སྒྲིབ་པ་རྣམ་པར་སྤང་བའི་ཕྱག་རྒྱའོ། །
en: Su is the seal of abandoning the obscuration of dullness.

source: ས་ཞེས་བྱ་བ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀུན་དུ་ཤེས་པར་བྱེད་པའི་ཕྱག་རྒྱའོ། །
en: Sa is the seal of gaining omniscience for all sentient beings.

source: ཧ་ཞེས་བྱ་བ་ནི་ཉམས་པ་ལ་བསྟེན་པའི་ཆོས་རྣམ་པར་སྤང་བའི་ཕྱག་རྒྱའོ། །
en: Hwa is the seal of abandoning dharmas that facilitate degeneration.

source: བྷ་ཞེས་བྱ་བ་ནི་དངོས་པོ་དང་དངོས་པོ་མེད་པ་རྗེས་སུ་རྟོགས་པར་བྱེད་པའི་ཕྱག་རྒྱའོ། །
en: Bha is the seal of gaining realization of existence and nonexistence.

source: ཚ་ཞེས་བྱ་བ་ནི་འདོད་པ་དང་། ཞེ་སྡང་དང་། འཇིག་པ་དང་། གཏི་མུག་རྣམ་པར་སྤོང་བའི་ཕྱག་རྒྱའོ། །
en: Tsha is the seal of relinquishing attachment, aversion, fear, and stupidity.

source: སྨ་ཞེས་བྱ་བ་ནི་དྲན་པ་དང་། ཤེས་བཞིན་དང་། བརྗེད་པ་མེད་པའི་ཕྱག་རྒྱའོ། །
en: Sma is the seal of mindfulness, alertness, and nonforgetfulness.

source: ཧྭ་ཞེས་བྱ་བ་ནི་བོད་པའི་ཕྱག་རྒྱའོ། །
en: Hwa is the seal of summoning.

source: ས་ཞེས་བྱ་བ་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་དོར་བའི་ཕྱག་རྒྱའོ། །
en: Sa is the seal of rejecting all afflictive emotions.

source: གྷ་ཞེས་བྱ་བ་ནི་ཐིབས་པོ་དང་། ལིང་ཏོག་དང་། མ་རིག་པ་སེལ་བའི་ཕྱག་རྒྱའོ། །
en: Gha is the seal of eliminating opacity, distorted vision, and ignorance.

source: ཋ་ཞེས་བྱ་བ་ནི་མཐར་ཐུག་པར་འགྲོ་བའི་ཕྱག་རྒྱའོ། །
en: Ṭha is the seal of reaching the ultimate.

source: ཎ་ཞེས་བྱ་བ་ནི་གྱ་ནོམ་པའི་ཆོས་རྗེས་སུ་རྟོགས་པར་བྱེད་པའི་ཕྱག་རྒྱའོ། །
en: Ṇa is the seal of gaining realization of excellent qualities.

source: ཕ་ཞེས་བྱ་བ་ནི་འབྲས་བུ་ཐོབ་པར་བྱེད་པའི་ཕྱག་རྒྱའོ། །
en: Pha is the seal of attaining the result.

source: སྐ་ཞེས་བྱ་བ་ནི་ཕུང་པོ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱག་རྒྱའོ། །
en: Ska is the seal of gaining comprehension of the aggregates.

source: ཛྭ་ཞེས་བྱ་བ་ནི་རིམས་ནད་སེལ་བའི་ཕྱག་རྒྱའོ། །
en: Dzwa is the seal of eradicating contagious diseases.

source: ཤྩ་ཞེས་བྱ་བ་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱ་བའི་ཕྱག་རྒྱའོ། །
en: Shtsa is the seal of directly and perfectly awakening wondrous marvelous qualities.

source: བ་ཞེས་བྱ་བ་ནི་ལམ་གྱི་རྒྱུན་གཅོད་ཅིང་མྱ་ངན་ལས་འདས་པ་རྗེས་སུ་ཐོབ་པར་བྱེད་པའི་ཕྱག་རྒྱའོ། །
en: Ba is the seal of reaching the end of the path and arriving in nirvāṇa.

source: ལ་ཞེས་བྱ་བ་ནི་ཡི་གེའི་མཐའ་ཐུག་པ་མེད་པའི་ཕྱག་རྒྱའོ། །
en: La is the seal of the infinitude of syllables.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་ཇི་སྙེད་ཀྱིས་ཆོས་སྟོན་པའི་ཡི་གེ་དེ་དག་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་བསྟན་པ་རབ་ཏུ་ཤེས་ཏེ།
en: “In this way, son of noble family, bodhisattvas, in as many ways as there are, comprehend the teaching of the seals represented by all these syllables used to teach the Dharma.

source: རིགས་ཀྱི་བུ་འདི་ནི་རྒྱ་མཚོའི་ཕྱག་རྒྱའི་གཟུངས་ཀྱི་སྒོར་འཇུག་པའོ། །
en: Son of noble family, this introduces the gateway of the ocean mudrā dhāraṇī.

source: རིགས་ཀྱི་བུ་དེ་ལ་པད་མ་བཀོད་པ་ཞེས་བྱ་བའི་གཟུངས་དེ་གང་ཞེ་ན།
en: (5) “Son of noble family, you may then ask, ‘What is the dhāraṇī called lotus array?’

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་འདི་ལ་རབ་ཏུ་གནས་པ་ནི་འཁོར་གྱི་དཀྱིལ་འཁོར་གང་དང་གང་དུ་ཆོས་བསྟན་པ་དེ་དང་དེར་དེའི་པད་མའི་སྟན་སྣ་ཚོགས་པ་བལྟ་ན་སྡུག་པ་འབྱུང་སྟེ
en: Regarding bodhisattvas who are established in this dhāraṇī, wherever and in whichever assembly they choose to teach the Dharma, various beautiful lotus seats will blossom forth.

source: དེ་པད་མའི་སྟན་དེ་ལ་འདུག་མ་ཐག་ཏུ་སྟེང་གི་བར་སྣང་ལས་པད་མའི་ཆར་འབབ་བོ། །
en: As soon as they sit down on their lotus seats, a rain of lotus flowers will shower from the sky,

source: པད་མ་དེ་དག་ལས་ཀྱང་ཆོས་བསྟན་པ་རྣམ་པ་སྣ་ཚོགས་འབྱུང་སྟེ། འདི་ལྟ་སྟེ། ཟབ་མོ་བསྟན་པ་དང་། སྣ་ཚོགས་བསྟན་པ་དང་། དཔེ་བརྗོད་པ་བསྟན་པ་དང་། མདོ་དང་དབྱངས་ཀྱིས་བསྙད་པ་དང་། ལུང་བསྟན་པ་དང་། ཚིགས་སུ་བཅད་པ་དང་། ཆེད་དུ་བརྗོད་པ་དང་། གླེང་གཞི་དང་། དེ་ལྟ་བུ་འབྱུང་བ་དང་། སྐྱེས་པའི་རབས་དང་། ཤིན་ཏུ་རྒྱས་པ་དང་། ཆོས་གཏན་ལ་དབབ་པ་བསྟན་པ་དག་སྟོན་པར་འགྱུར་རོ། །
en: and various kinds of doctrinal teachings will issue forth from them: profound discourses, variegated discourses, illustrative discourses, expositions, melodic verses, prophecies, metered verses, praises, ethical narratives, ancient narratives, past life accounts, epic stories, and authoritative explications will manifest in this way.

source: པད་མ་ལས་ཆོས་བརྗོད་པ་བྱུང་བ་དེའང་དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྱུར་རོ། །
en: “The reverberation of Dharma emanating from the lotus flowers alleviates suffering.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ཡང་བཏང་སྙོམས་སུ་བྱེད་ཅིང་མི་སྨྲ་བ་དང་། མཉམ་པར་བཞག་པའི་གནས་ཀྱང་མི་འདོར་རོ། །
en: The bodhisattvas remain neutral and silent without abandoning resting in equipoise.

source: པད་མ་འབྱུང་བ་ལས་ངེས་པར་བྱུང་བ་དེ་ཡང་དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྱུར་ཏེ། སངས་རྒྱས་ཀྱི་མཛད་པ་ཡང་བྱེད་དོ། །
en: The deliverance issuing from the manifested lotus flowers alleviates suffering and instigates the buddha activities.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་ལུས་ཀྱི་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་འོད་ཟེར་དག་འབྱུང་ངོ་། །
en: “Light rays burst forth from each and every pore of the bodhisattvas’ bodies.

source: འོད་ཟེར་དེ་དག་ལས་ཀྱང་པད་མ་དག་འབྱུང་ངོ་། །པད་མ་དེ་དག་ལས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་རྣམས་འབྱུང་སྟེ།
en: Lotus flowers blossom from these light rays, and more bodhisattva forms emerge from these lotus flowers.

source: དེ་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་ཏུ་དོང་ནས་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་དེ།
en: These disperse into the vast, immeasurable world realms in the ten directions and perform buddha activities.

source: འདི་ནི་པད་མ་བཀོད་པའི་གཟུངས་ཀྱི་སྒོར་འཇུག་པའོ། །
en: This is the introduction to the gateway of the lotus array dhāraṇī.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཆགས་པ་མེད་པའི་སྒོར་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས་གང་ཞེ་ན།
en: (6) “Son of noble family, you may then ask, ‘What is the entering the gate of nonattachment dhāraṇī?’

source: འདི་ལྟ་སྟེ། བསྟན་པ་གཅིག་ལ་མི་ཆགས་སོ། །བསྟན་པ་གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། དྲུག་དང་། བདུན་དང་། བརྒྱད་དང་། དགུ་དང་བཅུ་དག་ལ་མི་ཆགས་སོ། །
en: It consists in not being attached to a single teaching and not being attached to two, three, four, five, six, seven, eight, nine, or ten teachings.

source: བསྟན་པ་ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུ་དང་། དྲུག་ཅུ་དང་། བདུན་ཅུ་དང་། བརྒྱད་ཅུ་དང་། དགུ་བཅུ་དང་། བརྒྱ་དག་ལ་མི་ཆགས་སོ། །
en: It consists in not being attached to twenty, thirty, forty, fifty, sixty, seventy, eighty, ninety, or a hundred teachings.

source: བསྟན་པ་སྟོང་ལ་མི་ཆགས་སོ། །བསྟན་པ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་ལ་མི་ཆགས་སོ། །བསྟན་པ་ཐེར་འབུམ་དང་། ཁྲག་ཁྲིག་དང་། གཏམས་དང་། དཀྲིགས་དང་། མི་འཁྲུགས་པ་དང་། ཚད་མེད་པ་དང་། གྲངས་མེད་པ་དང་། མཚུངས་པ་མེད་པ་དང་། གཞལ་དུ་མེད་པ་དང་། དཔག་ཏུ་མེད་པ་ལ་མི་ཆགས་སོ། །
en: It consists in not being attached to a thousand, a hundred thousand, ten million, ten thousand million, or a hundred thousand million teachings. It consists in not being attached to a quadrillion, one hundred quadrillion, ten quintillion, immeasurable, innumerable, an incomparable number of, or an unfathomable number of teachings.

source: བསྟན་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ལ་མི་ཆགས་སོ། །བསྟན་པ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ལ་མི་ཆགས་སོ། །བསྟན་པ་གླིང་བཞི་པའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ལ་མི་ཆགས་སོ། །བསྟན་པ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ལ་མི་ཆགས་སོ། །
en: “It consists in not being attached to a number of teachings as vast as the number of grains of sand in the river Ganges, as vast as the number of particles in Jambudvīpa, as vast as the number of atoms of the four continents, as vast as the number of atoms in twenty, thirty, forty, or fifty trichiliocosms or in a buddhafield.

source: བསྟན་པ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ལ་མི་ཆགས་པ་ནས། བསྟན་པ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ལ་མི་ཆགས་སོ། །
en: It consists in not being attached to the number of teachings ranging from a number as vast as the number of grains of sand in the river Ganges in a single buddhafield to a number as vast as the quantity of atoms in all the buddhafields.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཆོས་ཀྱི་སྒོ་གང་དང་གང་བརྩམས་པའི་ཆོས་ཀྱི་སྒོ་དེ་དང་དེའི་བསྟན་པ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་བསྟན་པ་གཅིག་གིས་སྟོན་ཏོ། །གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། དྲུག་དང་། བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུ་དང་། བརྒྱ་དང་། སྟོང་དང་། ཚད་མེད་པའི་བསྟན་པས་སྟོན་ཏེ
en: “In this way, son of noble family, one teaches the gateways to the Dharma and their teachings, commencing with any gateway up to as many as the number of atoms in all buddhafields, through a single presentation, through two, three, four, five, six, ten, twenty, thirty, forty, or fifty teachings, or through hundreds, thousands, or a limitless number of teachings.

source: ལྡན་པ་དང་། འབྱོར་པ་དང་། ཤིན་ཏུ་ངེས་པའི་ཚིག་དང་། དོན་དང་། ཚིག་འབྲུ་དང་ལྡན་པར་སྟོན་ཀྱང་ཆགས་པ་མེད་ཅིང་རྒྱུན་ཆད་པ་མེད་དེ།
en: Although one teaches using lexical imputations and associations and using precisely defined words, meanings, and syllables, one will be neither attached nor interrupted.

source: འདི་ནི་ཆགས་པ་མེད་པའི་སྒོར་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས་སོ། །
en: This is the dhāraṇī called entering the gate of nonattachment.

source: རིགས་ཀྱི་བུ་དེ་ལ་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམ་པར་ངེས་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས་གང་ཞེ་ན།
en: (7) “Son of noble family, you may ask, ‘What is the dhāraṇī called entering ascertainment by discriminating knowledge?’

source: གང་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྟན་པ་མི་ཟད་པ་ཤེས་པ་དང་། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྟན་པ་མི་ཟད་པ་ཤེས་པ་དང་། ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྟན་པ་མི་ཟད་པ་ཤེས་པ་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྟན་པ་མི་ཟད་པ་ཤེས་པ་སྟེ།
en: One knows meaning, phenomena, etymologies, and eloquence.

source: ཤེས་པ་འདི་ལྟ་བུ་རབ་ཏུ་ཐོབ་པ་དེ་ལ་ཤར་ཕྱོགས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་འདུས་ཏེ། རང་རང་གི་སྐད་ཀྱིས་དོན་ལ་མཁས་པ་ཡོངས་སུ་དྲིས།
en: When all sentient beings of the eastern direction gather around one who has attained these kinds of knowledge, they inquire—each in their own language—about the mastery of meanings.

source: གང་དག་ལྷོ་ཕྱོགས་ཀྱི་སེམས་ཅན་དེ་དག་གིས་ནི་ཆོས་ལ་མཁས་པ་ཡོངས་སུ་དྲིས།
en: Beings of the southern direction inquire about the mastery of phenomena.

source: གང་དག་ནུབ་ཕྱོགས་ཀྱི་སེམས་ཅན་དེ་དག་གིས་ནི་ངེས་པའི་ཚིག་ལ་མཁས་པ་ཡོངས་སུ་དྲིས།
en: Beings of the western direction inquire about the mastery of etymology.

source: གང་དག་བྱང་ཕྱོགས་ཀྱི་སེམས་ཅན་དེ་དག་གིས་ནི་སྤོབས་པ་ལ་མཁས་པ་ཡོངས་སུ་དྲིས་ན་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ངག་གི་ལས་ཀྱང་དེ་སྙེད་དུ་ཚད་མེད་དེ།
en: And beings of the northern direction inquire about the mastery of eloquence. When this occurs, the bodhisattvas’ vocal deeds will be correspondingly immense.

source: དུས་གཅིག་ཏུ་བརྗོད་ཅིང་སྐད་སྣ་ཚོགས་ལ་འཇུག་པ་ལ་བརྗེད་པར་མི་འགྱུར། སེམས་གཡེང་བར་མི་འགྱུར་རོ། །
en: They will speak and employ various languages at the same time, without forgetting any and without their minds becoming distracted.

source: སྐད་ལ་འཇུག་པ་ཤེས་པས་སྐད་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་ཏེ།
en: Knowing how to use languages, they adapt to all languages.

source: སྐད་ཅིག་བརྗོད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྣམ་པར་རིག་པ་ཚིམ་པར་བྱེད་དེ།
en: By one moment of utterance, they bring knowledge that satisfies the minds of all sentient beings.

source: འདི་ནི་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམ་པར་ངེས་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས་སོ། །
en: This is the dhāraṇī called entering ascertainment by discriminating knowledge.

source: རིགས་ཀྱི་བུ་དེ་ལ་སངས་རྒྱས་ཀྱི་རྒྱན་བྱིན་གྱིས་བརླབས་པ་ཞེས་བྱ་བའི་གཟུངས་གང་ཞེ་ན།
en: (8) “Son of noble family, you may ask, ‘What is the dhāraṇī called blessing of the buddha ornaments?’

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་འདི་ལྟ་བུ་རབ་ཏུ་ཐོབ་པ། ཆོས་ཀྱི་སྟན་ཆེན་པོ་ལ་འདུག་པ། འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོའི་དབུས་ན་འདུག་པའི་སྤྱི་གཙུག་གི་དྲང་ཐད་ཀྱི་སྟེང་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་གསེར་གྱི་མདོག་ཅན་མཚན་དང་དཔེ་བྱད་ཀྱིས་ལེགས་པར་བརྒྱན་པའི་ལུས་དང་ལྡན་པའི་གཟུགས་འབྱུང་སྟེ
en: Son of noble family, for bodhisattvas who have attained this dhāraṇī, the form of the Tathāgata, golden in color with a body adorned with the auspicious marks and signs and seated on a great Dharma seat in the center of a large circle of attendants, will manifest right above the crowns of their heads.

source: དེ་བཞིན་གཤེགས་པའི་གཟུགས་དེས་ཕྱག་གཡས་པ་དེའི་སྤྱི་གཙུག་ཏུ་འཇོག་གོ། །
en: The Tathāgata’s form places its right hand on top of their heads.

source: ཕྱག་བཞག་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་སངས་རྒྱས་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་ལུས་ཀྱི་ལས་དང་ལྡན་པར་འགྱུར་རོ། །སངས་རྒྱས་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་ངག་གི་ལས་དང་ལྡན་པར་འགྱུར་རོ། །སངས་རྒྱས་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་དྲན་པའི་ལས་དང་ལྡན་པར་འགྱུར་རོ། །
en: As soon as it touches them, they are endowed with the activities of body, speech, and mind adorned by buddha ornaments.

source: དེ་ཆོས་དེ་ལྟ་བུ་དང་ལྡན་ཏེ། འཁོར་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་བསམ་པ་ལ་འཇུག་པས་སོ་སོ་ཅི་རིགས་པར་ཆོས་སྟོན་ཏོ། །
en: Endowed with such qualities they can engage the mental dispositions of any audience and thereby teach the Dharma in a manner suited to each individual.

source: ཞག་གཅིག་གམ། ཞག་གཉིས་སམ། ཞག་གསུམ་མམ། ཞག་བཞིའམ། ཞག་བདུན་ནམ། ཟླ་བ་ཕྱེད་དམ། ཟླ་བ་གཅིག་གམ། དུས་སམ། ལོ་ཁྱུད་ཀོར་རམ། ལོ་བརྒྱའམ། སྟོང་ངམ། ལོ་བརྒྱ་ཕྲག་སྟོང་ངམ། ཇི་ཙམ་དུ་འདོད་པ་དེ་ཙམ་དུ་ཁ་ཟས་དང་བྲལ་བའི་རྒྱུད་ཀྱིས་ཆོས་སྟོན་ཀྱང་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་ཤིན་ཏུ་ཡོངས་སུ་བཟུང་བའི་ཕྱིར་དེའི་ཆོས་ཀྱི་སྒོ་ཡོངས་སུ་ཟད་པར་མི་འགྱུར། ལུས་དང་སེམས་ངལ་བར་མི་འགྱུར་རོ། །
en: “However long they wish to teach the Dharma uninterruptedly without nourishment—whether it is for a day or two, three or four days, a week, a fortnight, a month, a season, or the course of a year, or even for a hundred years, a thousand years, or a hundred thousand years—because they are sustained by the blessings of the tathāgatas, whose gateways of Dharma are inexhaustible in number, they do not grow weary either physically or mentally.

source: ཤེས་པ་ཆེན་པོ་བཞི་དང་ལྡན་པར་འགྱུར་ཏེ།
en: “They possess four kinds of great knowledge.

source: སེམས་ཅན་གྱི་བསམ་པ་དང་། ཚིག་རབ་ཏུ་དབྱེ་བ་ཤེས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་མི་ཟད་པ་ཤེས་པ་དང་། ཐེག་པ་ཇི་ལྟར་རྣམ་པར་དགོད་པ་ཤེས་པ་དང་། སོ་སོ་ཅི་རིགས་པར་ཆོས་བསྟན་པ་ཤེས་པ་དང་ལྡན་པར་འགྱུར་ཏེ
en: They know how to distinguish the dispositions and words of sentient beings, they know the inexhaustible four types of discriminating knowledge, they know how to delineate the vehicles, and they know how to teach the Dharma in accordance with each individual.

source: རིགས་ཀྱི་བུ་འདི་ནི་སངས་རྒྱས་ཀྱི་རྒྱན་བྱིན་གྱིས་བརླབས་པའི་གཟུངས་གང་ཆུང་ཟད་གཞོལ་བའི་སྒོར་འཇུག་པ་ཞེས་བྱའོ། །
en: “Son of noble family, this is known as the concise introduction to the gateway of the blessing of the buddha ornaments dhāraṇī.

source: གཟུངས་འདི་ནི་མི་ཟད་པ། ཐུག་པ་མེད་པའི་རྗེས་སུ་སོང་བ། དེ་བཞིན་གཤེགས་པའི་མཚམས་དང་བཅས་པ་དང་བསྟན་པ་ཚད་མེད་པའོ། །
en: This dhāraṇī is inexhaustible, continues endlessly, embodies the scope of the tathāgatas, and is a boundless teaching.

source: གཟུངས་དེ་དག་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་ཀུན་དུ་འཛིན་ཏོ། །ཆོས་སྟོན་པ་ནི་མི་ཟད་པར་འགྱུར་རོ། །
en: Bodhisattvas who are established in these dhāraṇīs retain what all the buddhas say and uphold the Dharma they teach.

source: དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: Then Dhāraṇīśvara­rāja spoke these verses:

source: བདེ་གཤེགས་རྣམས་ཀྱིས་རབ་ཏུ་གསུངས་པའི་གཟུངས་བརྒྱད་པོ། །ཐེག་པ་འདིར་ནི་དེ་དག་རྣམ་པར་ངེས་ཐོབ་པ། །
en: (1) “While those in this vehicle who have attained The eight dhāraṇīs taught by the sugatas
